{
  "version": "1.2",
  "lastUpdated": "2026-01-15",
  "description": "Accurate MLBB hero skills data from Mobile Legends Wiki - expanded with 31 popular meta heroes",
  "skills": {
    "miya": {
      "passive": {
        "name": "Moon Blessing",
        "description": "Each time Miya hits a target with her Basic Attack, she gains 5% Attack Speed for 4 seconds. Stacks up to 5 times. After reaching full stacks, Miya summons a Moonlight Shadow with each Basic Attack that deals 30 (+25% Total Physical Attack) Physical Damage.",
        "cooldown": null,
        "damage": "30 (+25% Total Physical Attack)",
        "effect": "5% Attack Speed per stack, max 5 stacks"
      },
      "skill1": {
        "name": "Moon Arrow",
        "description": "Miya shoots two extra arrows with each Basic Attack, dealing 10-35 (+100% Total Physical Attack) Physical Damage to the target enemy and 30% damage to nearby targets. This effect lasts 4 seconds.",
        "cooldown": "10-8s",
        "damage": "10-35 (+100% Total Physical Attack)",
        "effect": "Duration: 4 seconds"
      },
      "skill2": {
        "name": "Arrow of Eclipse",
        "description": "Miya launches an empowered arrow on the target area, dealing 270-420 (+45% Total Physical Attack) Physical Damage to enemies within and immobilizing them for 1.2 seconds. The arrow then splits into 6 scattering minor arrows, each dealing 40-105 (+20% Total Physical Attack) Physical Damage and slowing by 30% for 2 seconds.",
        "cooldown": "12-10s",
        "damage": "270-420 (+45% Total Physical Attack)",
        "effect": "1.2s immobilize, 30% slow for 2s"
      },
      "ultimate": {
        "name": "Hidden Moonlight",
        "description": "Miya removes all debuffs and conceals herself, gaining 65% extra Movement Speed. This state lasts 2 seconds or until she launches an attack. Miya gains full stacks of Moon Blessing upon leaving the state.",
        "cooldown": "40-32s",
        "damage": null,
        "effect": "2s concealment, 65% movement speed, full stacks"
      }
    },
    "fanny": {
      "passive": {
        "name": "Air Superiority",
        "description": "During flight, Fanny deals 10%-20% extra damage to enemies hit (scales with flying speed) and applies a stack of Prey Mark to them (up to 2 stacks). Her subsequent skill hits on marked enemy heroes restore 7 energy per stack.",
        "cooldown": null,
        "damage": "10%-20% bonus damage",
        "effect": "7 energy per Prey Mark stack"
      },
      "skill1": {
        "name": "Tornado Strike",
        "description": "Fanny whirls her blades, dealing 300-540 (+80% Total Physical Attack) Physical Damage to nearby enemies.",
        "cooldown": "1s",
        "damage": "300-540 (+80% Total Physical Attack)",
        "effect": "AoE around Fanny"
      },
      "skill2": {
        "name": "Steel Cable",
        "description": "Fanny shoots a cable in the target direction that pulls her to the first obstacle hit. She can cast this skill again within 2 seconds until her energy runs out. Each successive cast reduces the skill's energy cost by 2. Fanny automatically casts Tornado Strike upon hitting an enemy mid-flight.",
        "cooldown": "0.2s",
        "damage": "Triggers Tornado Strike",
        "effect": "Energy cost: 10-2 per cast"
      },
      "ultimate": {
        "name": "Cut Throat",
        "description": "Fanny leaps at the target enemy hero or Creep with her blades, dealing 500-860 (+240% Extra Physical Attack) Physical Damage. Each stack of Prey Mark increases this damage by 20%.",
        "cooldown": "45-35s",
        "damage": "500-860 (+240% Extra Physical Attack)",
        "effect": "+20% damage per Prey Mark stack"
      }
    },
    "ling": {
      "passive": {
        "name": "Cloud Walker",
        "description": "Ling's superb Lightness Skill helps him leap among walls. When resting on the wall, he gains 4 Lightness Points per second and 5 extra Lightness Points each time he deals damage. Ling gains 1.6 times Crit Chance from all sources but only has 150% Critical Damage.",
        "cooldown": null,
        "damage": null,
        "effect": "Wall-walking, 4 energy/s on walls, 150% crit damage"
      },
      "skill1": {
        "name": "Finch Poise",
        "description": "Passive: Ling's Critical Chance is permanently increased by 2.5%-12.5%. Active: Ling leaps onto the designated wall, entering half-stealth state, restoring Lightness Points more quickly and gaining 30% Movement Speed. When using this skill to jump from a wall to another, it resets the Cooldown.",
        "cooldown": "7-5s",
        "damage": null,
        "effect": "2.5%-12.5% crit chance, 30% movement speed, half-stealth"
      },
      "skill2": {
        "name": "Defiant Sword",
        "description": "Ling charges in a designated direction and stabs nearby enemies at his destination, dealing 300-400 (+40% Total Physical Attack) Physical Damage. If cast from a wall, deals extra 30% slow for 1.5s. If critically strikes, slows by extra 45% for 0.75s. Restores 35-60 HP per hit.",
        "cooldown": "6-4s",
        "damage": "300-400 (+40% Total Physical Attack)",
        "effect": "30%-75% slow, 35-60 HP restore, 0.75s untargetable"
      },
      "ultimate": {
        "name": "Tempest of Blades",
        "description": "Ling leaps into the air, becoming invincible and gaining 10% extra Movement Speed for 1.5 seconds. He then lands, dealing 250-450 (+100% Total Physical Attack) Physical Damage, knocking enemies in center airborne for 1 second, and creating a Sword Field for 8 seconds. Four blades appear on edges that reduce Finch Poise CD by 4s when collected.",
        "cooldown": "50-40s",
        "damage": "250-450 (+100% Total Physical Attack)",
        "effect": "1.5s invincibility, 1s knockup, 8s sword field"
      }
    },
    "gusion": {
      "passive": {
        "name": "Dagger Specialist",
        "description": "Each skill cast adds a rune to Gusion's dagger (stacks up to 4 times). Each stack enhances Gusion's next Basic Attack to deal additional damage equal to 3% of the target's max HP and restore 50 (+25% Total Magic Power) HP to himself.",
        "cooldown": null,
        "damage": "3% target max HP per stack",
        "effect": "50 (+25% Total Magic Power) HP restore per rune"
      },
      "skill1": {
        "name": "Sword Spike",
        "description": "Gusion throws a dagger in the target direction, dealing 200-300 (+50% Total Magic Power) Magic Damage to the first enemy hit and marking them. Use Again: Gusion moves behind the marked enemy, dealing 200-300 (+100% Total Magic Power) Magic Damage to them. This skill cannot be interrupted while moving.",
        "cooldown": "10-7s",
        "damage": "200-300 (+50% Magic Power) + 200-300 (+100% Magic Power)",
        "effect": "Mark duration: 4 seconds"
      },
      "skill2": {
        "name": "Shadowblade Slaughter",
        "description": "Gusion throws five daggers in the target direction, each dealing 110-210 (+50% Total Magic Power) Magic Damage and slowing by 6% for 2s (stacks up to 30%). Use Again: Gusion recalls the daggers, each dealing 65-115 (+40% Total Magic Power) Magic Damage.",
        "cooldown": "10-7s",
        "damage": "110-210 (+50% Magic Power) x5 + 65-115 (+40% Magic Power) x5",
        "effect": "6%-30% slow for 2 seconds"
      },
      "ultimate": {
        "name": "Incandescence",
        "description": "Gusion dashes to the target location, resetting the cooldown of Sword Spike and Shadowblade Slaughter. If Shadowblade Slaughter was cast once before the reset, Gusion can throw another five daggers and recall a total of ten daggers. Use Again: Gusion dashes a short distance.",
        "cooldown": "45-35s",
        "damage": null,
        "effect": "Resets all skill cooldowns, allows double Shadowblade Slaughter"
      }
    },
    "lancelot": {
      "passive": {
        "name": "Soul Cutter",
        "description": "Each time Lancelot dashes or charges, his damage is increased by 7.5% for 4 seconds (stacks up to 4 times, max 30% damage increase).",
        "cooldown": null,
        "damage": "7.5% damage increase per stack",
        "effect": "Max 4 stacks (30% total), 4 second duration"
      },
      "skill1": {
        "name": "Puncture",
        "description": "Lancelot charges in the target direction, dealing 100-250 (+50% Total Physical Attack) Physical Damage to enemies along the way and applying a Sword Mark. If the mark is successfully applied, Puncture's cooldown is reset.",
        "cooldown": "10-7s",
        "damage": "100-250 (+50% Total Physical Attack)",
        "effect": "Applies Sword Mark, CD reset on mark"
      },
      "skill2": {
        "name": "Thorned Rose",
        "description": "Lancelot performs 3 strikes in the target direction, each dealing 225-400 (+100% Extra Physical Attack) Physical Damage (reduced to 30% on multiple enemies). Lancelot is untargetable and invincible during the skill. Enemies hit are slowed by 20% (stacks up to 60%). Spell Vamp effectiveness reduced to 50%.",
        "cooldown": "12-10s",
        "damage": "225-400 (+100% Extra Physical Attack) x3",
        "effect": "Untargetable during cast, 20%-60% slow, 50% spell vamp"
      },
      "ultimate": {
        "name": "Phantom Execution",
        "description": "Lancelot charges at the target enemy, dealing 350 (+170% Total Physical Attack) Physical Damage. Lancelot is invincible throughout the dash.",
        "cooldown": "35-25s",
        "damage": "350 (+170% Total Physical Attack)",
        "effect": "Invincible throughout dash"
      }
    },
    "hayabusa": {
      "passive": {
        "name": "Ninjutsu: Trace of Shadow",
        "description": "Hayabusa's attacks apply Shadow Marks on enemies (max 4 stacks). Each stack increases Hayabusa's damage to the target by 5% for 6 seconds (max 20%).",
        "cooldown": null,
        "damage": "5% damage increase per stack",
        "effect": "Max 4 stacks (20% total), 6 second duration"
      },
      "skill1": {
        "name": "Ninjutsu: Phantom Shuriken",
        "description": "Hayabusa throws 3 returning shurikens in the target direction, each dealing 150-250 (+70% Extra Physical Attack) Physical Damage and slowing by 35% for 2 seconds. Multiple hits deal 30% damage. Passive: Permanently grants 3%-18% Spell Vamp. Restores 10 energy per non-minion hit.",
        "cooldown": "6-4s",
        "damage": "150-250 (+70% Extra Physical Attack) x3",
        "effect": "35% slow for 2s, 3%-18% spell vamp passive, 10 energy per hit"
      },
      "skill2": {
        "name": "Ninjutsu: Quad Shadow",
        "description": "Hayabusa dashes forward and releases 4 phantoms dealing 130-180 (+30% Extra Physical Attack) Physical Damage and slowing by 40% for 2s. Recast: Hayabusa teleports to a phantom location, reduces Skill 1 CD by 1s, and deals damage if attached to a hero.",
        "cooldown": "14-12s",
        "damage": "130-180 (+30% Extra Physical Attack)",
        "effect": "40% slow for 2s, 4 phantoms, teleport mechanic, -1s Skill 1 CD"
      },
      "ultimate": {
        "name": "Ougi: Shadow Kill",
        "description": "Hayabusa blends into shadows and launches 6 single-target attacks, each dealing 140 (+75% Extra Physical Attack) Physical Damage. Prioritizes marked enemies, consuming marks for 45-85 (+20% Extra Physical Attack) extra damage. Does not apply new marks.",
        "cooldown": "40-32s",
        "damage": "140 (+75% Extra Physical Attack) x6 + mark bonus",
        "effect": "Untargetable during cast, consumes Shadow Marks for bonus damage"
      }
    },
    "alucard": {
      "passive": {
        "name": "Pursuit",
        "description": "After casting a skill, Alucard's next Basic Attack dashes to the target and deals (+140% Total Physical Attack) Physical Damage.",
        "cooldown": null,
        "damage": "+140% Total Physical Attack",
        "effect": "Enhanced dash attack after each skill"
      },
      "skill1": {
        "name": "Groundsplitter",
        "description": "Alucard leaps and slashes, dealing 270-370 (+110% Extra Physical Attack) Physical Damage to enemies in an area and slowing them by 40% for 2 seconds.",
        "cooldown": "10-7s",
        "damage": "270-370 (+110% Extra Physical Attack)",
        "effect": "40% slow for 2 seconds"
      },
      "skill2": {
        "name": "Whirling Smash",
        "description": "Alucard spins his sword in a circle, dealing 345-570 (+120% Extra Physical Attack) Physical Damage to nearby enemies.",
        "cooldown": "5-3s",
        "damage": "345-570 (+120% Extra Physical Attack)",
        "effect": "AOE damage around Alucard"
      },
      "ultimate": {
        "name": "Fission Wave",
        "description": "Passive: Grants 10%-30% extra Hybrid Lifesteal. Active: Alucard charges power, then releases a shockwave dealing 400-700 (+200% Extra Physical Attack) Physical Damage. During charging, reduces enemy movement by 30% and defense by 10-20, grants 10-20 defense per hero hit, and reduces skill CD by 50% for 6 seconds. Second cast releases the wave.",
        "cooldown": "45-35s",
        "damage": "400-700 (+200% Extra Physical Attack)",
        "effect": "10%-30% lifesteal passive, 30% slow, defense reduction, 50% skill CD reduction for 6s"
      }
    },
    "chou": {
      "passive": {
        "name": "Only Fast",
        "description": "After traveling 5 units, Chou's next Basic Attack deals 180% damage (cannot Crit), slows the target by 80% briefly, and reduces their Physical Defense by 10 (+1 per hero level) for 3 seconds (stacks up to 2 times).",
        "cooldown": null,
        "damage": "180% Basic Attack damage",
        "effect": "80% slow, Physical Defense reduction stacks 2 times"
      },
      "skill1": {
        "name": "Jeet Kune Do",
        "description": "Chou strikes in the target direction, dealing 180 (+70% Total Physical Attack) Physical Damage to enemies hit. Can be cast 3 times. On the 3rd cast, also knocks enemies airborne. Hitting an enemy hero with the 3rd cast resets Shunpo's cooldown.",
        "cooldown": "8-6s",
        "damage": "180 (+70% Total Physical Attack) x3",
        "effect": "3rd cast knocks airborne, resets Skill 2 CD if hits hero"
      },
      "skill2": {
        "name": "Shunpo",
        "description": "Chou charges in the target direction, gaining Control Immunity and a 200 (+200% Extra Physical Attack) Physical Damage shield.",
        "cooldown": "8-6s",
        "damage": null,
        "effect": "200 (+200% Extra Physical Attack) shield, Control Immunity"
      },
      "ultimate": {
        "name": "The Way of Dragon",
        "description": "Chou strikes the target enemy hero with a roundhouse kick, dealing 400 (+200% Extra Physical Attack) Physical Damage and knocking them back. Cast again to chase and deal a total of 480 (+220% Extra Physical Attack) Physical Damage.",
        "cooldown": "40-32s",
        "damage": "400-480 (+200%-220% Extra Physical Attack)",
        "effect": "Knockback, suppression, chase ability"
      }
    },
    "kagura": {
      "passive": {
        "name": "Yin Yang Gathering",
        "description": "Upon retrieving the Seimei Umbrella, Kagura gains a 280 (+50% Total Magic Power) shield, stuns nearby enemies for 0.5 seconds, and slows them by 60% for 1 second. Cooldown: 4.5 seconds.",
        "cooldown": "4.5s",
        "damage": null,
        "effect": "280 (+50% Total Magic Power) shield, 0.5s stun, 60% slow for 1s"
      },
      "skill1": {
        "name": "Seimei Umbrella Open",
        "description": "Kagura sends the Seimei Umbrella to target location, dealing 315-590 (+105% Total Magic Power) Magic Damage to enemies in its path and slowing them by 60% for 0.5 seconds. The umbrella returns automatically when too far away. Deals 130% damage to non-hero enemies.",
        "cooldown": "6-4s",
        "damage": "315-590 (+105% Total Magic Power)",
        "effect": "60% slow for 0.5s, 130% damage to creeps"
      },
      "skill2": {
        "name": "Rasho Umbrella Flee",
        "description": "With Umbrella: Kagura removes all debuffs and dashes in target direction, leaving umbrella behind. Without Umbrella: Kagura invokes umbrella power, dealing 330-470 (+105% Total Magic Power) Magic Damage, knocking back and slowing nearby enemies by 60% for 0.5 seconds.",
        "cooldown": "6-4s",
        "damage": "330-470 (+105% Total Magic Power) (without umbrella)",
        "effect": "Remove debuffs, dash/knockback based on umbrella state"
      },
      "ultimate": {
        "name": "Yin Yang Overturn",
        "description": "With Umbrella: Invokes umbrella power, dealing 330-470 (+105% Total Magic Power) Magic Damage, knocking back and slowing enemies by 60% for 0.5s. Without Umbrella: Kagura dashes to umbrella location, pulling enemies along the path and dealing 400-600 (+120% Total Magic Power) Magic Damage at destination.",
        "cooldown": "8-6s",
        "damage": "330-470 or 400-600 (+105%-120% Total Magic Power)",
        "effect": "Knockback/pull based on umbrella state"
      }
    },
    "granger": {
      "passive": {
        "name": "Capriccio",
        "description": "Granger's unique Demon Hunting Gun and Cannon are powered by Demonic Energy. Gun has 800 base energy (restores 8% per second), Cannon has 800 base energy (restores 2% per second). Each minion/creep kill increases energy cap by 6 and restores 5%. Each hero kill/assist increases cap by 12 and restores 10%. Every 1% CD Reduction converts to 2 Physical Attack.",
        "cooldown": null,
        "damage": null,
        "effect": "800 base energy, +6/+12 cap per kill, CD Reduction converts to Physical Attack"
      },
      "skill1": {
        "name": "Rhapsody",
        "description": "Granger rapidly fires 6 shots with his Gun, each dealing 60-120 (+50% Total Physical Attack) Physical Damage and consuming 70 Gun Energy. The last bullet is guaranteed to Crit. Each bullet deals 70 extra damage to creeps/minions. Increases Movement Speed by 15% while firing. Stops when energy depleted or recast.",
        "cooldown": "Brief cooldown, requires 420+ Gun Energy",
        "damage": "60-120 (+50% Total Physical Attack) x6",
        "effect": "Last bullet crits, 15% movement speed, 70 bonus to creeps"
      },
      "skill2": {
        "name": "Rondo",
        "description": "Granger dashes in target direction, instantly restoring 15%-25% Gun Energy. Can be cast while channeling Rhapsody. Each Rhapsody hit reduces Rondo cooldown by 0.5 seconds.",
        "cooldown": "10-8s",
        "damage": null,
        "effect": "15%-25% Gun Energy restore, -0.5s CD per Rhapsody hit"
      },
      "ultimate": {
        "name": "Death Sonata",
        "description": "Granger fires his Cannon in target direction, dealing 150-300 (+100% Total Physical Attack) Physical Damage to first enemy hero hit and blast radius. Slows and reveals targets briefly. Can roll in joystick direction after each shot. Can cast while firing Rhapsody. Consumes 250 Cannon Energy per shot.",
        "cooldown": "Brief cooldown, requires 250 Cannon Energy",
        "damage": "150-300 (+100% Total Physical Attack)",
        "effect": "Slow, reveal, can roll between shots, passes through creeps"
      }
    },
    "beatrix": {
      "passive": {
        "name": "Mechanical Genius",
        "description": "Beatrix's talent produced 4 weapons of awe-inspiring firepower. Renner Basic Attack - Longshot: Fires powerful shot dealing (+360%-535% Total Physical Attack) Physical Damage to first target hit (can be dodged/blocked, 50% damage to creeps). Beatrix cannot crit, converts every 1% Critical Chance into 2 Physical Attack.",
        "cooldown": null,
        "damage": "+360%-535% Total Physical Attack (Renner)",
        "effect": "4 unique weapons, crit chance converts to Physical Attack"
      },
      "skill1": {
        "name": "Masterful Gunner",
        "description": "Passive: Beatrix carries 2 weapons at once, gains 5-30 Physical Attack. Active: Beatrix takes 0.6 seconds to swap primary weapon with secondary weapon, gaining new attack and Ultimate.",
        "cooldown": "1s",
        "damage": null,
        "effect": "5-30 Physical Attack passive, weapon swap mechanic"
      },
      "skill2": {
        "name": "Tactical Reposition",
        "description": "Beatrix moves forward based on current weapon (drops and rolls for Renner, leaps for Bennett, rolls sideways for Wesker, slides for Nibiru) and fully reloads current weapon.",
        "cooldown": "12-10s",
        "damage": null,
        "effect": "Mobility based on weapon, full reload"
      },
      "ultimate": {
        "name": "Renner's Apathy",
        "description": "Beatrix wields Renner calmly, aiming at enemy. When released, deals 700-1200 (+280% Total Physical Attack) Physical Damage to first enemy hit. Gets 50% Physical Lifesteal (not affected by Spell Vamp). Can aim up to 20 seconds. Can be dodged/blocked.",
        "cooldown": "40-30s",
        "damage": "700-1200 (+280% Total Physical Attack)",
        "effect": "50% Physical Lifesteal, 20s aim time, can be dodged"
      }
    },
    "wanwan": {
      "passive": {
        "name": "Tiger Pace",
        "description": "Enemy heroes hit by Wanwan's attacks will have their weakness exposed for 5 seconds. When hitting an enemy's weakness, Wanwan deals 67 (+3 × Hero Level) Extra True Damage and increases damage taken from her by 10% for 5 seconds. Wanwan can dash short distance after each Basic Attack, dash speed scales with Attack Speed.",
        "cooldown": null,
        "damage": "67 (+3 × Hero Level) True Damage",
        "effect": "Expose 3 weaknesses, dash after each attack, 10% increased damage taken"
      },
      "skill1": {
        "name": "Swallow's Path",
        "description": "Wanwan throws Fire Swallow in target direction, dealing 120 (+40% Total Physical Attack) Physical Damage. Fire Swallow turns into 3 rotating Swallow Daggers that fly back, each dealing 60 (+65% Total Physical Attack) Physical Damage and slowing by 30% for 1.5s. Enemies hit twice are immobilized for 0.5s.",
        "cooldown": "11-9s",
        "damage": "120 (+40% Total Physical Attack), daggers: 60 (+65% Total Physical Attack) each",
        "effect": "30% slow, 0.5s immobilize if hit twice"
      },
      "skill2": {
        "name": "Needles in Flowers",
        "description": "Wanwan removes all control effects on herself and triggers Tiger Pace. Shoots Deadly Needles in all directions, dealing 150 (+60% Total Physical Attack) Physical Damage to enemies hit.",
        "cooldown": "14-12s",
        "damage": "150 (+60% Total Physical Attack)",
        "effect": "Purify, 360° damage, triggers Tiger Pace dash"
      },
      "ultimate": {
        "name": "Crossbow of Tang",
        "description": "Wanwan leaps into air and fires arrows at target enemy hero for 2.5 seconds, dealing 60 (+35% Total Physical Attack) Physical Damage per arrow. If target is killed, switches to another enemy, gains 30% Attack Speed, extends duration by 1s (up to 3 times). Wanwan is untargetable and invincible. Can only cast on enemies with all weaknesses hit. Gains 100% Movement Speed during duration.",
        "cooldown": "45-40s",
        "damage": "60 (+35% Total Physical Attack) per arrow",
        "effect": "Untargetable, invincible, resets on kill, requires all weaknesses hit"
      }
    },
    "paquito": {
      "passive": {
        "name": "Champ Stance",
        "description": "After every 3 skill casts, Paquito enters Champ Stance, gaining enhanced skill ignoring cooldowns. He gains 60% extra Movement Speed that decays over 2.5s after casting enhanced skill. Paquito's Basic Attacks only deal (+85% Total Physical Attack) Physical Damage.",
        "cooldown": null,
        "damage": "+85% Total Physical Attack",
        "effect": "Enhanced skill every 3 casts, 60% movement speed"
      },
      "skill1": {
        "name": "Heavy Left Punch",
        "description": "Paquito throws punch in target direction, dealing 210-360 (+50% Total Physical Attack) Physical Damage. Gains 150-500 (+110% Total Physical Attack) shield for 2.5s if enemy hero is hit. Champ Stance: Damage increased to 350-600 (+100% Total Physical Attack), shield value increased to 120%.",
        "cooldown": "5-4s",
        "damage": "210-360 (+50% Total Physical Attack), Enhanced: 350-600 (+100% Total Physical Attack)",
        "effect": "Shield on hero hit, enhanced version has more damage and shield"
      },
      "skill2": {
        "name": "Jab",
        "description": "Paquito dashes in target direction and throws jab, dealing 150-450 (+150% Total Physical Attack) Physical Damage. Paquito stops and throws jab early upon colliding with enemy hero or creep. Champ Stance: Damage increased to 240-720 (+240% Total Physical Attack).",
        "cooldown": "7-5s",
        "damage": "150-450 (+150% Total Physical Attack), Enhanced: 240-720 (+240% Total Physical Attack)",
        "effect": "Dash, stops on collision with hero/creep"
      },
      "ultimate": {
        "name": "Knockout Strike",
        "description": "Paquito launches elbow strike in target direction, dealing 250-350 (+50% Total Physical Attack) Physical Damage and knocking back. Then throws haymaker, dealing 350-600 (+100% Total Physical Attack) Physical Damage and slowing by 75% for 1s. Champ Stance: Instead of haymaker, launches uppercut dealing 400-750 (+120% Total Physical Attack) and knocking airborne for 0.5s.",
        "cooldown": "38-28s",
        "damage": "Elbow: 250-350 (+50% Total Physical Attack), Haymaker: 350-600 (+100% Total Physical Attack), Enhanced Uppercut: 400-750 (+120% Total Physical Attack)",
        "effect": "Knockback + slow, Enhanced: knockback + airborne"
      }
    },
    "tigreal": {
      "passive": {
        "name": "Fearless",
        "description": "Tigreal gains stack of Fearless each time he casts skill or is hit by Basic Attack. After getting 4 stacks, Tigreal will consume all Fearless stacks to block next incoming Basic Attack (including turret attacks).",
        "cooldown": null,
        "damage": null,
        "effect": "Blocks next Basic Attack after 4 stacks"
      },
      "skill1": {
        "name": "Attack Wave",
        "description": "Tigreal smashes ground with hammer and sends shockwave forward that erupts 3 times, each dealing 270-520 (+70% Total Physical Attack) Physical Damage to enemies in fan-shaped area and slowing them by 20%/40%/60% for 1.5s.",
        "cooldown": "10-8s",
        "damage": "270-520 (+70% Total Physical Attack) per wave",
        "effect": "3 waves, stacking slow up to 60%"
      },
      "skill2": {
        "name": "Sacred Hammer",
        "description": "Tigreal charges in target direction, dealing (+100% Total Physical Attack) Physical Damage and pushing enemies to end of charge. Used Again: Can cast again within 4s, dealing 280-380 (+60% Total Physical Attack) Physical Damage and knocking airborne for 1s.",
        "cooldown": "14-11s",
        "damage": "First cast: (+100% Total Physical Attack), Second: 280-380 (+60% Total Physical Attack)",
        "effect": "Push then knockup, can Flicker during skill"
      },
      "ultimate": {
        "name": "Implosion",
        "description": "Tigreal unleashes power of hammer, stunning and pulling nearby enemies to him for 2s while dealing 270-430 (+130% Total Physical Attack) Physical Damage. First half can be interrupted by control effects. Second part cannot be interrupted except by Suppression.",
        "cooldown": "42-38s",
        "damage": "270-430 (+130% Total Physical Attack)",
        "effect": "Pull + 2s stun, can Flicker during skill"
      }
    },
    "khufra": {
      "passive": {
        "name": "Spell Curse",
        "description": "Khufra activates Spell Curse every 12s, enhancing next Basic Attack with extra range dealing [(+120% Total Physical Attack) (+target's 6% Max HP) Magic Damage], slows target by 30% for 1.5s and heals Khufra by 8% Max HP. Each control effect applied to enemy hero reduces cooldown by 4s.",
        "cooldown": "12s, reduced by 4s per control effect",
        "damage": "(+120% Total Physical Attack) (+target's 6% Max HP) Magic Damage",
        "effect": "30% slow, 8% Max HP heal, extended range"
      },
      "skill1": {
        "name": "Tyrant's Revenge",
        "description": "Khufra charges up then launches himself in specified direction, dealing 50-100 plus 7 (+1.5% Extra Physical Attack)% of Max HP Physical Damage to units on path. When reaching max distance or hitting enemy hero, stops and deals same damage to nearby enemies, knocking airborne up to 1.1s. Charge scales with channel time.",
        "cooldown": "12-10s",
        "damage": "50-100 plus 7 (+1.5% Extra Physical Attack)% Max HP",
        "effect": "Knockup duration scales with charge time (max 1.1s)"
      },
      "skill2": {
        "name": "Bouncing Ball",
        "description": "Khufra wraps himself into magic bouncing ball, increasing Physical & Magic Defense by 30%-100%. Enemies trying to use blink skills across Khufra are knocked airborne. Each bounce deals Magic Damage equal to 50-100 plus 3 (+2% Extra Physical Attack)% Max HP and slows by 80% for 0.2s.",
        "cooldown": "10-8s",
        "damage": "50-100 plus 3 (+2% Extra Physical Attack)% Max HP per bounce",
        "effect": "30%-100% def bonus, anti-dash, 80% slow per bounce"
      },
      "ultimate": {
        "name": "Tyrant's Rage",
        "description": "Khufra pulls back all enemy targets around him toward his front, dealing 300-600 (+100% Total Physical Attack) Physical Damage and slowing for 1.25-1.75s. If enemies knocked against walls, inflicts 150% extra damage and stuns instead of slows.",
        "cooldown": "38-34s",
        "damage": "300-600 (+100% Total Physical Attack), Wall hit: 450-900 (+150% Total Physical Attack)",
        "effect": "Pull + slow, stun if hit wall"
      }
    },
    "angela": {
      "passive": {
        "name": "Smart Heart",
        "description": "Angela gains 7.5% extra Movement Speed for 4s each time she casts skill (up to 30%). When attached to allied hero, Movement Speed boost is transferred to allied hero.",
        "cooldown": null,
        "damage": null,
        "effect": "7.5% movement speed per skill, max 30%, transfers when attached"
      },
      "skill1": {
        "name": "Love Waves",
        "description": "Angela sends Love Waves in target direction, dealing 170-320 (+80% Total Magic Power) Magic Damage, revealing positions briefly, and applying Lover's Mark (up to 5 stacks). Each stack increases damage by 20% and slows by 8% for 3s. Also restores 150-200 (+75% Total Magic Power) HP to allied heroes hit. Stores up to 5 charges.",
        "cooldown": "10-8s per charge",
        "damage": "170-320 (+80% Total Magic Power), +20% per Lover's Mark",
        "effect": "8% slow per stack (max 40%), reveal, heal allies, 5 charges"
      },
      "skill2": {
        "name": "Puppet-on-a-String",
        "description": "Angela launches Puppet String at target enemy, dealing 300-450 (+40% Total Magic Power) Magic Damage and gradually slowing up to 80%. If connected for 3s, immobilizes for 1.5s and deals 450-675 (+60% Total Magic Power) Magic Damage. Each Lover's Mark increases final damage by 20%.",
        "cooldown": "12-10s",
        "damage": "Initial: 300-450 (+40% Total Magic Power), Final: 450-675 (+60% Total Magic Power)",
        "effect": "Gradual slow to 80%, 1.5s immobilize after 3s"
      },
      "ultimate": {
        "name": "Heartguard",
        "description": "Angela channels for 2s, applying 1000-2000 (+200-300% Total Magic Power) shield lasting 6s to target allied hero regardless of distance. After channeling, attaches to ally for 12s, casting skills at zero Mana cost. Can cast again to detach by blinking away. Untargetable during attachment.",
        "cooldown": "60-50s",
        "damage": null,
        "effect": "Large shield, 12s attachment, untargetable, zero mana skills, blink detach"
      }
    },
    "freya": {
      "passive": {
        "name": "Power of War God",
        "description": "Freya gains 1 stack of Sacred Orb every 2s (max 12 stacks). Each Basic Attack consumes 1 stack. When casting skills, Freya consumes all stacks to deal 30 (+30% Total Physical Attack) Physical Damage per stack to nearby enemies, up to 360 (+360% Total Physical Attack) at 12 stacks.",
        "cooldown": null,
        "damage": "30 (+30% Total Physical Attack) per stack",
        "effect": "Gains stack every 2s, max 12, consumes on skill cast for AoE burst"
      },
      "skill1": {
        "name": "Wings of Faith",
        "description": "Freya leaps to target location, dealing 200-400 (+80% Total Physical Attack) Physical Damage to enemies on landing and slowing them by 40% for 1.5s. Increases her Attack Speed by 25%-50% for 4s.",
        "cooldown": "10-8s",
        "damage": "200-400 (+80% Total Physical Attack)",
        "effect": "Leap, 40% slow, 25%-50% attack speed buff"
      },
      "skill2": {
        "name": "Sacred Orb",
        "description": "Freya gains shield equal to 250-400 (+120% Total Physical Attack) for 3s and unleashes shockwave dealing 300-500 (+120% Total Physical Attack) Physical Damage to nearby enemies and stunning them for 1.2s.",
        "cooldown": "12-10s",
        "damage": "300-500 (+120% Total Physical Attack)",
        "effect": "Shield + 1.2s AoE stun"
      },
      "ultimate": {
        "name": "Valkyrie Descent",
        "description": "Freya spreads wings and gains power of Valkyrie for 10s. During this time, her Basic Attacks deal 110-130 (+80% Total Physical Attack) Physical Damage in a straight line to all enemies hit. Each attack applies 30% slow for 1s and grants her 10-15 Physical and Magic Defense, stacking up to 4 times. Prevents Sacred Orb stacking.",
        "cooldown": "42-38s",
        "damage": "110-130 (+80% Total Physical Attack) per attack",
        "effect": "10s duration, AoE attacks, 30% slow, defensive stacks, prevents passive stacking"
      }
    },
    "karina": {
      "passive": {
        "name": "Shadow Combo",
        "description": "Karina's skills can mark enemy heroes. When marked enemy takes damage from Karina's Basic Attack or skills, the mark explodes, dealing 140 (+20% Total Magic Power) (+10% target's Lost HP) True Damage and reducing Ultimate cooldown by 0.5s.",
        "cooldown": null,
        "damage": "140 (+20% Total Magic Power) (+10% target's Lost HP) True Damage",
        "effect": "Mark explosion, reduces Ultimate cooldown by 0.5s"
      },
      "skill1": {
        "name": "Elusiveness",
        "description": "Karina enters Shadow form for 3.5s, gaining 35%-50% Movement Speed, immunity to Basic Attacks, and 60% enhanced next Basic Attack or skill damage. If she kills enemy hero during this time, this skill's cooldown refreshes immediately.",
        "cooldown": "6.5-5s",
        "damage": null,
        "effect": "3.5s Shadow form, immune to Basic Attacks, 35%-50% movement speed, 60% damage boost, resets on kill"
      },
      "skill2": {
        "name": "Dance of Blades",
        "description": "Karina dashes toward enemy while spinning blades, dealing 100-200 (+60% Total Magic Power) Magic Damage. If this skill hits, she can cast it again up to 2 more times in 5s. Each cast increases damage by 10% (up to 30%). Applies mark on hit.",
        "cooldown": "9-7s",
        "damage": "100-200 (+60% Total Magic Power), increases by 10% per cast",
        "effect": "Triple dash, stacking damage, applies mark"
      },
      "ultimate": {
        "name": "Shadow Rush",
        "description": "Karina charges at target enemy hero, dealing 300-500 (+120% Total Magic Power) Magic Damage. Karina gains shield equal to 100-200 (+100% Total Magic Power) for 2s. If target dies within 3s, cooldown resets and 100 mana is refunded. Applies mark.",
        "cooldown": "40-32s",
        "damage": "300-500 (+120% Total Magic Power)",
        "effect": "Shield, resets on kill, mana refund, applies mark"
      }
    },
    "joy": {
      "passive": {
        "name": "Rhythm",
        "description": "Every 6s, Joy's next Basic Attack or skill becomes a Charged Attack, dealing 180 (+100% Total Magic Power) extra Magic Damage and slowing enemy by 30% for 1s. When she or her partner hit same target within 1s, triggers Rhythm, dealing 160-240 (+60% Total Magic Power) Magic Damage and restoring 80-120 (+30% Total Magic Power) HP to both.",
        "cooldown": "6s",
        "damage": "Charged: 180 (+100% Total Magic Power), Rhythm: 160-240 (+60% Total Magic Power)",
        "effect": "30% slow, duo damage + heal when hitting same target"
      },
      "skill1": {
        "name": "Glee",
        "description": "Joy summons music notes around her, each dealing 120-270 (+60% Total Magic Power) Magic Damage to enemies hit and slowing by 30% for 1s. Notes orbit for 6s. Can cast again to detonate all notes, each dealing 180-405 (+90% Total Magic Power) Magic Damage.",
        "cooldown": "10-8s",
        "damage": "Per note: 120-270 (+60% Total Magic Power), Detonate: 180-405 (+90% Total Magic Power)",
        "effect": "30% slow, orbiting notes, manual detonation"
      },
      "skill2": {
        "name": "Beat",
        "description": "Joy dashes in specified direction and increases Movement Speed by 30%-50% for 2s. Next Basic Attack within 5s becomes Charged Attack. During dash, purifies control effects.",
        "cooldown": "12-10s",
        "damage": null,
        "effect": "Dash, purify, 30%-50% movement speed, triggers Charged Attack"
      },
      "ultimate": {
        "name": "Passion",
        "description": "Joy links with target allied hero, both gaining 40%-70% Movement Speed for 3s. Linked ally's next 3 Basic Attacks each restore 50-80 HP to themselves and deal 120-220 (+70% Total Magic Power) extra Magic Damage. Joy can teleport to partner's location during link. 15s cooldown after link ends.",
        "cooldown": "50-40s",
        "damage": "120-220 (+70% Total Magic Power) per enhanced ally attack",
        "effect": "3s link, 40%-70% movement speed, teleport, enhances ally attacks, 50-80 HP restore per hit"
      }
    },
    "nana": {
      "passive": {
        "name": "Molina Smooch",
        "description": "When suffering fatal damage, Nana immediately transforms into adorable Molina and runs to safety. During this time, Nana is immune to all damage and control effects. After 2.5s, she will resurrect at Molina's location with 30% HP. This can only occur once every 150s.",
        "cooldown": "150s",
        "damage": null,
        "effect": "Revive with 30% HP, 2.5s invulnerability, immune to everything"
      },
      "skill1": {
        "name": "Magic Boomerang",
        "description": "Nana throws boomerang in target direction, dealing 280-480 (+120% Total Magic Power) Magic Damage to first enemy hit and slowing them by 25% for 2s. Boomerang returns, dealing 280-480 (+120% Total Magic Power) Magic Damage again to enemies hit and slowing by 30% for 2s.",
        "cooldown": "8-6s",
        "damage": "280-480 (+120% Total Magic Power) per hit (can hit twice)",
        "effect": "25% slow going out, 30% slow returning, hits twice"
      },
      "skill2": {
        "name": "Molina Blitz",
        "description": "Nana summons Molina in target direction. Molina chases nearby enemies, dealing 180-280 (+70% Total Magic Power) Magic Damage on contact and transforming them into adorable Molina for 1.5-2s. Transformed enemies cannot attack or use skills, movement speed reduced to 220. Stores up to 2 Molinas.",
        "cooldown": "11-9s per charge",
        "damage": "180-280 (+70% Total Magic Power)",
        "effect": "1.5-2s polymorph, reduces movement to 220, disables attacks/skills, 2 charges"
      },
      "ultimate": {
        "name": "Molina Gift",
        "description": "Nana throws magic ball at target location. After 1.5s delay, ball explodes dealing 400-600 (+180% Total Magic Power) Magic Damage to enemies in area and slowing them by 70% for 2.5s. Enemies at explosion center are stunned for 0.5-1s instead.",
        "cooldown": "36-31s",
        "damage": "400-600 (+180% Total Magic Power)",
        "effect": "1.5s delay, 70% slow, 0.5-1s stun at center"
      }
    },
    "harley": {
      "passive": {
        "name": "Poker Trick",
        "description": "Every 4s, Harley's next Basic Attack fires poker card in fan shape dealing 200-350 (+100% Total Magic Power) Magic Damage to enemies hit. Each enemy hero hit by skills or Enhanced Basic Attack grants Harley 1 stack of Magic Mastery (max 10), each increasing Magic Power by 5-8.",
        "cooldown": "4s",
        "damage": "200-350 (+100% Total Magic Power)",
        "effect": "Fan-shaped attack, gains 5-8 Magic Power per stack (max 10)"
      },
      "skill1": {
        "name": "Poker Flash",
        "description": "Harley throws 3 flying cards in target direction. Each card deals 200-350 (+60% Total Magic Power) Magic Damage to first enemy hit and returns. Harley recovers 40-80 HP when catching returning card.",
        "cooldown": "8-6s",
        "damage": "200-350 (+60% Total Magic Power) per card",
        "effect": "3 cards, 40-80 HP per card caught, applies Magic Mastery"
      },
      "skill2": {
        "name": "Space Escape",
        "description": "Harley jumps into another dimension, leaving hat at his original location for 3s. Can recast to return to hat's location. While in alternate dimension, Harley gains 30% Movement Speed and immunity to all damage.",
        "cooldown": "12-10s",
        "damage": null,
        "effect": "3s invulnerability, 30% movement speed, teleport back to hat"
      },
      "ultimate": {
        "name": "Deadly Magic",
        "description": "Harley summons 12 ring blades around target enemy, each dealing 130-190 (+45% Total Magic Power) Magic Damage. If only 1 enemy hero is hit, damage increases to 200-300 (+75% Total Magic Power) per blade. Slows target by 60% for 2s.",
        "cooldown": "42-37s",
        "damage": "130-190 (+45% Total Magic Power) per blade, Single target: 200-300 (+75% Total Magic Power) per blade (12 blades total)",
        "effect": "60% slow, massive single-target burst, applies Magic Mastery"
      }
    },
    "hanabi": {
      "passive": {
        "name": "Ninjutsu: Equinox",
        "description": "Hanabi is immune to all control effects. Instead, she loses 15-30 Mana when hit by crowd control. If not enough Mana, loses 10% Max HP. Her Basic Attacks cannot crit but bounce to 4 nearby enemies, dealing 30%-45% damage with each bounce. Converts Critical Chance to Physical Penetration at 1:1 ratio.",
        "cooldown": null,
        "damage": "30%-45% per bounce (4 bounces)",
        "effect": "CC immunity (costs mana/HP), crit immunity, converts crit to penetration, AoE basic attacks"
      },
      "skill1": {
        "name": "Ninjutsu: Petal Barrage",
        "description": "Hanabi unleashes 4 petal blades in fan-shaped area, each dealing 140-240 (+90% Total Physical Attack) Physical Damage and slowing enemies by 40% for 2s.",
        "cooldown": "10-8s",
        "damage": "140-240 (+90% Total Physical Attack) per blade",
        "effect": "4 blades, 40% slow, fan-shaped AoE"
      },
      "skill2": {
        "name": "Ninjutsu: Soul Scroll",
        "description": "Hanabi generates Higanbana shield equal to 20-30% Max HP, lasting 2s. While shield is active, she gains 50% Movement Speed and immunity to slow effects. When shield breaks or expires, deals 120-220 (+50% Total Physical Attack) Physical Damage to nearby enemies.",
        "cooldown": "18-16s",
        "damage": "120-220 (+50% Total Physical Attack)",
        "effect": "20-30% Max HP shield, 50% movement speed, slow immunity, AoE damage on end"
      },
      "ultimate": {
        "name": "Forbidden Jutsu: Higanbana",
        "description": "Hanabi launches Higanbana at target enemy, dealing 400-600 (+120% Total Physical Attack) Physical Damage. The Higanbana spreads to other enemies, dealing same damage. Enemies hit by Higanbana become linked. If any linked enemy takes damage, 20% damage is shared with other linked enemies. Lasts 5s.",
        "cooldown": "50-42s",
        "damage": "400-600 (+120% Total Physical Attack)",
        "effect": "Spreads between enemies, 5s duration, 20% damage share between all linked targets"
      }
    },
    "odette": {
      "passive": {
        "name": "Avian Authority",
        "description": "Odette gains 1 stack of Avian Authority each time she deals damage with skills (max 10 stacks, lasts 6s). Each stack increases Magic Power by 4-10. When at full stacks, Odette and her swan deal 30% more damage.",
        "cooldown": null,
        "damage": null,
        "effect": "4-10 Magic Power per stack (max 10), 30% damage boost at max stacks"
      },
      "skill1": {
        "name": "Avian Sanctuary",
        "description": "Odette summons swan around herself, dealing 200-350 (+80% Total Magic Power) Magic Damage to nearby enemies and slowing them by 40% for 2s. Odette also gains shield equal to 300-500 (+150% Total Magic Power) for 3s. Swan orbits for 3s, dealing 100-175 (+40% Total Magic Power) Magic Damage per second to enemies nearby.",
        "cooldown": "8-6s",
        "damage": "Initial: 200-350 (+80% Total Magic Power), Per second: 100-175 (+40% Total Magic Power)",
        "effect": "40% slow, shield, orbiting swan damage"
      },
      "skill2": {
        "name": "Blue Nova",
        "description": "Odette releases energy ball in target direction, dealing 300-450 (+105% Total Magic Power) Magic Damage to first enemy hit and stunning them for 1s. The ball then returns, dealing same damage. If Odette catches returning ball, cooldown reduces by 40%.",
        "cooldown": "11-9s",
        "damage": "300-450 (+105% Total Magic Power) per hit (can hit twice)",
        "effect": "1s stun, can hit twice, 40% cooldown reduction if caught"
      },
      "ultimate": {
        "name": "Swan Song",
        "description": "Odette channels for 2.5s, during which she and swan become one, continuously dealing 160-260 (+85% Total Magic Power) Magic Damage per wave to nearby enemies (7 waves total). During channeling, Odette cannot move but gains 30% damage reduction and immunity to crowd control.",
        "cooldown": "46-41s",
        "damage": "160-260 (+85% Total Magic Power) per wave (7 waves)",
        "effect": "2.5s channel, 30% damage reduction, CC immunity, immobile, 7 damage waves"
      }
    },
    "mathilda": {
      "passive": {
        "name": "Spirit of Annoyance",
        "description": "After using skill, Mathilda's next Basic Attack deals 200-340 (+50% Total Magic Power) extra Magic Damage and steals 30%-50% Movement Speed from target for 1.5s. She also gains 15 Physical & Magic Defense for 3s.",
        "cooldown": null,
        "damage": "200-340 (+50% Total Magic Power)",
        "effect": "Steal 30%-50% movement speed, gain 15 def"
      },
      "skill1": {
        "name": "Soul Bloom",
        "description": "Mathilda releases Abyssal energy that circles around her 3 times. Each circle deals 200-300 (+60% Total Magic Power) Magic Damage and slows enemies by 30% for 2s. Each hit increases damage by 12%. She gains 20%-30% Movement Speed while releasing energy.",
        "cooldown": "10-8s",
        "damage": "200-300 (+60% Total Magic Power) per circle, increases by 12% per hit",
        "effect": "3 circles, 30% slow, 20%-30% movement speed, stacking damage"
      },
      "skill2": {
        "name": "Guiding Wind",
        "description": "Mathilda dashes in target direction, dealing 250-400 (+50% Total Magic Power) Magic Damage to enemies along path. Can recast up to 3 times in 8s. If she passes through allied hero, grants both 40% Movement Speed for 1s and enhanced next Basic Attack.",
        "cooldown": "16-14s",
        "damage": "250-400 (+50% Total Magic Power) per dash",
        "effect": "Triple dash, buff allies touched, 40% movement speed"
      },
      "ultimate": {
        "name": "Circling Eagle",
        "description": "Mathilda hops onto target allied hero for 2.5s. During this time, target gains 20%-40% Attack and Movement Speed. When dismounting, Mathilda shockwaves nearby enemies, dealing 450-750 (+150% Total Magic Power) Magic Damage and pulling them towards landing point, then stunning for 0.75s.",
        "cooldown": "42-37s",
        "damage": "450-750 (+150% Total Magic Power)",
        "effect": "2.5s ride, buff ally's attack/movement, AoE pull + 0.75s stun on dismount"
      }
    },
    "estes": {
      "passive": {
        "name": "Moonlight Immersion",
        "description": "Every 8s, Estes' next Basic Attack deals 250 (+90% Total Magic Power) extra Magic Damage and restores 35-60 (+15% Total Magic Power) HP to himself and nearby allies. Enhanced Basic Attack cannot crit and does not trigger attack effects.",
        "cooldown": "8s",
        "damage": "250 (+90% Total Magic Power)",
        "effect": "Heal 35-60 (+15% Total Magic Power) to self and nearby allies"
      },
      "skill1": {
        "name": "Moonlight Grace",
        "description": "Estes calls upon Moonlight to heal target ally, restoring 280-430 (+90% Total Magic Power) HP immediately, then recovering 160-260 (+50% Total Magic Power) HP over 3s. During healing, target gains 50% Slow Resistance.",
        "cooldown": "8-6s",
        "damage": null,
        "effect": "Instant heal + heal over time, 50% slow resistance"
      },
      "skill2": {
        "name": "Domain of Moon Goddess",
        "description": "Estes prays to Moon Goddess, dealing 250-400 (+50% Total Magic Power) Magic Damage to enemies in target area and slowing them by 60% for 2s. Simultaneously, all allied heroes in area recover 230-380 (+80% Total Magic Power) HP and gain immunity to slow effects for 2s.",
        "cooldown": "11-9s",
        "damage": "250-400 (+50% Total Magic Power)",
        "effect": "60% slow to enemies, heal + slow immunity to allies"
      },
      "ultimate": {
        "name": "Blessing of Moon Goddess",
        "description": "Estes channels blessing of Moon Goddess for 3s, recovering HP equal to 340-480 (+120% Total Magic Power) per second to all nearby allied heroes. During channeling, Estes recovers 80% less HP. Can be interrupted by control effects.",
        "cooldown": "46-41s",
        "damage": null,
        "effect": "3s channel, massive AoE heal per second, can be interrupted, Estes heals 80% less"
      }
    },
    "selena": {
      "passive": {
        "name": "Symbiosis",
        "description": "Selena has two forms with different skills and abilities. In Elven form, her skills apply Abyssal Mark (max 2 stacks) to enemy heroes. In Abyssal form, she gains 30% extra Movement Speed and her skills consume Abyssal Marks for extra effects. Switching forms has 2.5s cooldown.",
        "cooldown": "2.5s form switch",
        "damage": null,
        "effect": "Dual form, marks in Elven, consumes marks in Abyssal, 30% movement speed in Abyssal"
      },
      "skill1": {
        "name": "Abyssal Trap (Elven) / Abyssal Arrow (Abyssal)",
        "description": "Elven: Selena summons Abyssal Devil at target location for 90s, granting vision. When enemy hero approaches, trap explodes dealing 250-500 (+30% Total Magic Power) Magic Damage, stunning for 0.5s and revealing for 5s. Stores 3 traps. Abyssal: Selena fires arrow in target direction, dealing 300-600 (+90% Total Magic Power) Magic Damage to first enemy hero hit and stunning for 0.5-3s based on distance. Consumes all marks for 120-320 (+80% Total Magic Power) extra True Damage per mark.",
        "cooldown": "10-8s (Elven), 12-10s (Abyssal)",
        "damage": "Elven: 250-500 (+30% Total Magic Power), Abyssal: 300-600 (+90% Total Magic Power) + 120-320 (+80% Total Magic Power) True Damage per mark",
        "effect": "Elven: 3 traps, vision, 0.5s stun. Abyssal: 0.5-3s stun, consumes marks for True Damage"
      },
      "skill2": {
        "name": "Abyssal Soul (Elven) / Primal Darkness (Abyssal)",
        "description": "Elven: Selena summons Abyssal Soul at location, dealing 300-450 (+70% Total Magic Power) Magic Damage. Soul flies to nearby enemy heroes for 3s, dealing 80-130 (+30% Total Magic Power) Magic Damage per hit. Abyssal: Selena charges forward, dealing 200-350 (+100% Total Magic Power) Magic Damage. If she hits enemy with Abyssal Mark, dashes again and resets skill cooldown. Attacks consume all marks for 70-170 (+40% Total Magic Power) Magic Damage per mark.",
        "cooldown": "11-9s (Elven), 8-6s (Abyssal)",
        "damage": "Elven: 300-450 (+70% Total Magic Power) + 80-130 (+30% Total Magic Power) per hit. Abyssal: 200-350 (+100% Total Magic Power) + 70-170 (+40% Total Magic Power) per mark",
        "effect": "Elven: Summons persistent soul. Abyssal: Dash, resets on marked enemy, consumes marks"
      },
      "ultimate": {
        "name": "Primal Darkness (Elven→Abyssal) / Blessing of Moon God (Abyssal→Elven)",
        "description": "Transforms between Elven and Abyssal forms. In Abyssal form, Selena gains 30% Movement Speed and her Basic Attacks become melee, dealing 50% more damage. Enhanced Basic Attacks apply Abyssal Taint, dealing 200-400 (+160% Total Magic Power) Magic Damage over 3s.",
        "cooldown": "2.5s",
        "damage": "Abyssal Basic Attack DoT: 200-400 (+160% Total Magic Power) over 3s",
        "effect": "Form switch, Abyssal: 30% movement speed, melee attacks, 50% basic attack damage boost, DoT"
      }
    },
    "julian": {
      "passive": {
        "name": "Smith's Legacy",
        "description": "Julian has two forms with different abilities. Sword Form: Gains 8-16 Physical & Magic Defense and 20% extra Physical Lifesteal. Basic Attacks deal extra 50 (+30% Total Physical Attack) Physical Damage. Scythe Form: Gains 30-60 extra Physical & Magic Penetration and 20% extra Spell Vamp. Basic Attacks deal extra 60 (+60% Total Magic Power) Magic Damage.",
        "cooldown": null,
        "damage": "Sword: 50 (+30% Total Physical Attack), Scythe: 60 (+60% Total Magic Power)",
        "effect": "Sword: 8-16 def, 20% Physical Lifesteal. Scythe: 30-60 penetration, 20% Spell Vamp"
      },
      "skill1": {
        "name": "Flying Swords / Scythe Shred",
        "description": "Sword: Julian throws flying swords forward, each dealing 150-250 (+60% Total Physical Attack) Physical Damage. Swords return, dealing 150-250 (+60% Total Physical Attack) Physical Damage again. Scythe: Julian charges scythe forward, dealing 300-500 (+90% Total Magic Power) Magic Damage. Scythe returns, dealing 300-500 (+90% Total Magic Power) Magic Damage and pulling enemies along path.",
        "cooldown": "8-6s",
        "damage": "Sword: 150-250 (+60% Total Physical Attack) per hit (2 hits), Scythe: 300-500 (+90% Total Magic Power) per hit (2 hits)",
        "effect": "Sword: Dual damage. Scythe: Dual damage + pull on return"
      },
      "skill2": {
        "name": "Blade Storm / Scythe Horror",
        "description": "Sword: Julian dashes forward and swings sword, dealing 200-350 (+80% Total Physical Attack) Physical Damage. Can cast again to dash back, dealing same damage. Scythe: Julian blinks to location and swings scythe, dealing 250-450 (+100% Total Magic Power) Magic Damage. Can cast again to blink back, dealing same damage and slowing by 40% for 2s.",
        "cooldown": "12-10s",
        "damage": "Sword: 200-350 (+80% Total Physical Attack) per dash, Scythe: 250-450 (+100% Total Magic Power) per blink",
        "effect": "Sword: Double dash. Scythe: Double blink + 40% slow"
      },
      "ultimate": {
        "name": "Dissimilation",
        "description": "Julian transforms between Sword and Scythe forms. Upon transformation, unleashes energy dealing 300-600 (+100% of Total Physical Attack and Total Magic Power) Hybrid Damage to nearby enemies. Sword→Scythe: Enemies are knocked airborne for 0.8s. Scythe→Sword: Creates shield equal to 500-900 (+100% of Total Physical Attack and Total Magic Power) for 3s.",
        "cooldown": "18-14s",
        "damage": "300-600 (+100% of Total Physical Attack and Total Magic Power) Hybrid",
        "effect": "Sword→Scythe: 0.8s knockup. Scythe→Sword: Large shield"
      }
